"""
    int a = 0;

"""

d = 9

"""
целочисленый тип

4 
456736409

0b0101000011101
0o1434354312342354
0x43523123987abcdef
"""

print(0b0101000011101)
print(0o1434354342354)
print(0x4352987abcdef)

print(type(0b0101000011101))
print(type(0o1434354342354))
print(type(0x4352987abcdef))

print(834659843265948765983712659387659438765438765981347 * 7894365983216598317256326587436597843396593276539786)

"""
вещественный тип (десятичные дроби)

3454.56754

от 2.23e-308 до 1.79e+308
2.23 * 10 ^ -308   -----   1.79 * 10 ^ +308
"""

a = 3 ** 1000
print(a)
# print(a + 0.1)

print(0.1 + 0.1 + 0.1)

print(type(4.6))

"""
комплексные числа

4+6j
"""

print(type(2+3j)) # https://habr.com/ru/post/246747/

"""
строковый тип
"""

print("Hello World!")
print(type('Hello World!'))

"""
списки (list),
кортеж (tuple)
множества (set, frozenset)
словари (dict)
"""

